<?php
//  ------------------------------------------------------------------------ //
// 本模組由 prolin 製作
// 製作日期：2014-07-01
// $Id:$
// ------------------------------------------------------------------------- //

/*-----------引入檔案區--------------*/
include_once "header_admin.php";
//樣版
$xoopsOption['template_main'] = "esss_index_adm_tpl.html";
include_once "header.php";
 

/*-----------function區--------------*/
//取得參數


 
/*-----------執行動作判斷區----------*/
 

 

//取得最近的期別---------------------------------------------------------------------------------------------------------------------
$data['kind'] = get_sign_kind() ;
 
 		
//取得已報名的班級數
$data['class_sum'] = sum_sign_data( );
		

/*-----------秀出結果區--------------*/

$xoopsTpl->assign( "data" , $data ) ; 

 
include_once 'footer.php';
?>